Autodesk.Revit.DB.Category.GetBuiltInExtendedPropertiesCategories
Get the ForgeTypeId identifier for each category supporting extended properties.
Returns: The identifiers of categories supporting extended properties.

Autodesk.Revit.DB.Category.GetBuiltInCategoryDisciplines(Autodesk.Revit.DB.BuiltInCategory)
Get the ForgeTypeId identifier for each discipline for the given built-in category.
Remarks:
The returned list contains one or more identifiers of disciplines that can be compared with
Autodesk::Revit::DB::DisciplineTypeId.
The given BuiltInCategory value must be valid according to
Category.IsBuiltInCategoryValid(BuiltInCategory).
categoryId:
The built-in category.
Returns:
The identifiers of disciplines for the given built-in category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId is not a valid built-in category. See Category.IsBuiltInCategoryValid(BuiltInCategory).
Since:
2027